
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 15 to change, 2 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.POSTGRES-USER-FLEXIBLE
  * azurerm_key_vault_secret.POSTGRES-USER-FLEXIBLE-REPLICA
  * azurerm_key_vault_secret.POSTGRES_DATABASE-FLEXIBLE
  * azurerm_key_vault_secret.POSTGRES_DATABASE-FLEXIBLE-REPLICA
  * azurerm_key_vault_secret.POSTGRES_HOST-FLEXIBLE
  * azurerm_key_vault_secret.POSTGRES_HOST-FLEXIBLE-REPLICA
  * azurerm_key_vault_secret.POSTGRES_PORT-FLEXIBLE
  * azurerm_key_vault_secret.POSTGRES_PORT-FLEXIBLE-REPLICA
  * module.sdp_db_user.random_password.sdp_read_user_password
  * module.wa_task_management_api_database_flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.wa_task_management_api_database_flexible.azurerm_resource_group.rg[0]
  * module.wa_task_management_api_database_flexible.random_password.password
  * module.wa_task_management_api_database_flexible_replica.azurerm_postgresql_flexible_server.pgsql_server
  * module.wa_task_management_api_database_flexible_replica.azurerm_resource_group.rg[0]
  * module.wa_task_management_api_database_flexible_replica.random_password.password
* Replace
  * module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-USER-FLEXIBLE will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-USER-FLEXIBLE" {
        id                      = "https://wa-prod.vault.azure.net/secrets/cft-task-POSTGRES-USER-FLEXIBLE/ef0dd8ca7fb84915a23ca91ce3a9100e"
        name                    = "cft-task-POSTGRES-USER-FLEXIBLE"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES-USER-FLEXIBLE-REPLICA will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-USER-FLEXIBLE-REPLICA" {
        id                      = "https://wa-prod.vault.azure.net/secrets/cft-task-POSTGRES-USER-FLEXIBLE-REPLICA/22e021a734b84a3387cbeac747d66d3e"
        name                    = "cft-task-POSTGRES-USER-FLEXIBLE-REPLICA"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE-FLEXIBLE will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_DATABASE-FLEXIBLE" {
        id                      = "https://wa-prod.vault.azure.net/secrets/cft-task-POSTGRES-DATABASE-FLEXIBLE/38fe95723b324d63b8c48e26753a42f1"
        name                    = "cft-task-POSTGRES-DATABASE-FLEXIBLE"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE-FLEXIBLE-REPLICA will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_DATABASE-FLEXIBLE-REPLICA" {
        id                      = "https://wa-prod.vault.azure.net/secrets/cft-task-POSTGRES-DATABASE-FLEXIBLE-REPLICA/44154da98d3f4f9b94e7c1f4f26eb08d"
        name                    = "cft-task-POSTGRES-DATABASE-FLEXIBLE-REPLICA"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST-FLEXIBLE will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST-FLEXIBLE" {
        id                      = "https://wa-prod.vault.azure.net/secrets/cft-task-POSTGRES-HOST-FLEXIBLE/725d6f44ad8d453db8d7e29d62ac1935"
        name                    = "cft-task-POSTGRES-HOST-FLEXIBLE"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST-FLEXIBLE-REPLICA will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST-FLEXIBLE-REPLICA" {
        id                      = "https://wa-prod.vault.azure.net/secrets/cft-task-POSTGRES-HOST-FLEXIBLE-REPLICA/2d60fe9b7ef3410e95cd884f2a640a54"
        name                    = "cft-task-POSTGRES-HOST-FLEXIBLE-REPLICA"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_PORT-FLEXIBLE will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_PORT-FLEXIBLE" {
        id                      = "https://wa-prod.vault.azure.net/secrets/cft-task-POSTGRES-PORT-FLEXIBLE/12e90ca4ff4a4653a988775083dda072"
        name                    = "cft-task-POSTGRES-PORT-FLEXIBLE"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_PORT-FLEXIBLE-REPLICA will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_PORT-FLEXIBLE-REPLICA" {
        id                      = "https://wa-prod.vault.azure.net/secrets/cft-task-POSTGRES-PORT-FLEXIBLE-REPLICA/5de0dd25696040d087590ebb160ef933"
        name                    = "cft-task-POSTGRES-PORT-FLEXIBLE-REPLICA"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # module.sdp_db_user.data.azurerm_key_vault.sdp_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "sdp_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "mi-vault-prod"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "mi-prod-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.sdp_db_user.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_name must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      ~ id                      = "https://mi-vault-prod.vault.azure.net/secrets/cft-task-postgres-db-flexible-replica-read-user-name/89347949b3c047079875cc2513a6d009" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod" # forces replacement -> (known after apply) # forces replacement
        name                    = "cft-task-postgres-db-flexible-replica-read-user-name"
      ~ resource_id             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/cft-task-postgres-db-flexible-replica-read-user-name/versions/89347949b3c047079875cc2513a6d009" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/cft-task-postgres-db-flexible-replica-read-user-name" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "89347949b3c047079875cc2513a6d009" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-prod.vault.azure.net/secrets/cft-task-postgres-db-flexible-replica-read-user-name" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_password must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      ~ id                      = "https://mi-vault-prod.vault.azure.net/secrets/cft-task-postgres-db-flexible-replica-read-user-password/0025c4b510ee48e590fba35494d3a92d" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod" # forces replacement -> (known after apply) # forces replacement
        name                    = "cft-task-postgres-db-flexible-replica-read-user-password"
      ~ resource_id             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/cft-task-postgres-db-flexible-replica-read-user-password/versions/0025c4b510ee48e590fba35494d3a92d" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/cft-task-postgres-db-flexible-replica-read-user-password" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "0025c4b510ee48e590fba35494d3a92d" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-prod.vault.azure.net/secrets/cft-task-postgres-db-flexible-replica-read-user-password" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.sdp_db_user.random_password.sdp_read_user_password will be updated in-place
  ~ resource "random_password" "sdp_read_user_password" {
        id               = "none"
        # (13 unchanged attributes hidden)
    }

  # module.wa_task_management_api_database_flexible.azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-prod"
        name                          = "cft-task-postgres-db-flexible-prod"
      ~ tags                          = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2024-10-21T15:45:41Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible.azurerm_resource_group.rg[0] will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-data-prod"
        name     = "cft-task-postgres-db-flexible-data-prod"
      ~ tags     = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2024-10-21T15:45:41Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.wa_task_management_api_database_flexible.random_password.password will be updated in-place
  ~ resource "random_password" "password" {
        id               = "none"
        # (13 unchanged attributes hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-replica-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-replica-prod"
        name                          = "cft-task-postgres-db-flexible-replica-prod"
      ~ tags                          = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2024-10-21T15:45:41Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_resource_group.rg[0] will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-replica-data-prod"
        name     = "cft-task-postgres-db-flexible-replica-data-prod"
      ~ tags     = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2024-10-21T15:45:41Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.random_password.password will be updated in-place
  ~ resource "random_password" "password" {
        id               = "none"
        # (13 unchanged attributes hidden)
    }

Plan: 2 to add, 15 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1270,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->